stock_api/app/controllers/holdings_controller.rb

    def index
        holdings = Holding.all
---
SELECT "holdings".* FROM "holdings"

    def create
        user = User.find(params[:user_id])

        if user.valid?
            if user.holdings.find_by(ticker: params[:ticker])
                holding = user.holdings.find_by(ticker: params[:ticker])
                new_quantity = holding.quantity + params[:quantity].to_i
                holding.update_attribute(:quantity, new_quantity)
                render json: {holding: holding}

            else
                holding = Holding.create(holding_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "holdings".* FROM "holdings" WHERE "holdings"."user_id" = $1 AND "holdings"."ticker" = $2 LIMIT $3  [["user_id", 1], ["ticker", "NKE"], ["LIMIT", 1]]
SELECT "holdings".* FROM "holdings" WHERE "holdings"."user_id" = $1 AND "holdings"."ticker" = $2 LIMIT $3  [["user_id", 2], ["ticker", "NKE"], ["LIMIT", 1]]
UPDATE "users" SET "balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["balance", "4157.1"], ["updated_at", "2020-03-09 15:22:18.802486"], ["id", 1]]
UPDATE "holdings" SET "quantity" = $1, "updated_at" = $2 WHERE "holdings"."id" = $3  [["quantity", 6], ["updated_at", "2020-03-09 15:22:18.806113"], ["id", 7]]
INSERT INTO "holdings" ("ticker", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ticker", "NKE"], ["quantity", 2], ["user_id", 1], ["created_at", "2020-03-09 04:54:11.348313"], ["updated_at", "2020-03-09 04:54:11.348313"]]