stock_api/app/controllers/transactions_controller.rb

    def create
        user = User.find(params[:user_id])

        if user.valid? && params[:total].to_f <= user.balance
            new_balance= user.balance - params[:total].to_f
            user.update_attribute(:balance, new_balance)
            transaction = Transaction.create(transaction_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["balance", "4786.29"], ["updated_at", "2020-08-24 21:18:12.534216"], ["id", 7]]
INSERT INTO "transactions" ("ticker", "quantity", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ticker", "MSFT"], ["quantity", 2], ["price", "161.57"], ["user_id", 1], ["created_at", "2020-03-09 04:31:17.185620"], ["updated_at", "2020-03-09 04:31:17.185620"]]