stock_api/app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "balance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def profile
        token = request.headers['Authorization'].split(" ")[1]
        decoded_token = JWT.decode( token, ENV['SECRET'], true, {algorithm: 'HS256'})
        user_id = decoded_token[0]["user_id"]
        current_user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]